{
    "version": "https://jsonfeed.org/version/1",
    "title": "Paul Ashraf",
    "home_page_url": "https://www.paulashraf.com",
    "feed_url": "https://www.paulashraf.com/rss/feed.json",
    "description": "Paul Ashraf Software Finds and Movie Reviews",
    "icon": "https://www.paulashraf.com/favicon.ico",
    "author": {
        "name": "Paul Ashraf"
    },
    "items": [
        {
            "id": "https://www.paulashraf.com/blog/my-neighbour-totoro",
            "content_html": "<p>The second Miyazaki film I&#x27;ve seen (after the infamous Spirited Away) and it had me gripped all the way, exactly like Spirited Away. This for sure will be the start of my Studio Ghibli journey.</p>\n<p>The movie opens with a finendy child-like Song about Totoro, and as the first act plays out, you are delighted with of the most simple, gorgeous, gripping children movie you&#x27;ll ever see. And here, I&#x27;m not saying a children movie as a negative!</p>\n<img src=\"/_next/static/media/1.5fdc752a.jpeg\" width=\"1200\" height=\"675\" decoding=\"async\" data-nimg=\"future\" loading=\"lazy\" style=\"color:transparent\"/>\n<p>The story is about two girls, Stuski and Mei, moving to rural Japan with their father, while their mother is in the hospilal. As they battle the fact that their mother is sick, and the fear of living in a new place, they stert letling thier imagination roam free.</p>\n<p>By doing this, we are delighted with a gorgeous, expertly cralled, deeply personl peice of cinema.\nWhile the movie is relatively &quot;action-free&quot;, and the plot could be summariesed in a couple of lines, the movie it&#x27;s beautiful frames will grip you from start to the finish with it&#x27;s beautiful frames, wonderful music and personal story.</p>\n<img src=\"/_next/static/media/2.231efc8a.jpeg\" width=\"1600\" height=\"900\" decoding=\"async\" data-nimg=\"future\" loading=\"lazy\" style=\"color:transparent\"/>\n<p>I was not suprised that this movie was largly, auto-biographical, and you will definitly feel it. Miyazaki has to change the charchter to two girls, in order not to make it too personal. I still prefer Spirited Away over this, but part at me just enjoy these very simple films.</p>\n<p>This will definetly be rewatched many many times again.\n8/10.</p>",
            "url": "https://www.paulashraf.com/blog/my-neighbour-totoro",
            "title": "My Neighbor Totoro (1988) dir. Hayao Miyazaki",
            "summary": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.",
            "date_modified": "2022-09-29T00:00:00.000Z",
            "author": {
                "name": "Paul Ashraf"
            }
        }
    ]
}